Revit 2027 API
ExportDGNSettings.Create(Document, String) Method
 Create a DGN export settings with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDGNSettings Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As ExportDGNSettings
public:
static ExportDGNSettings^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> ExportDGNSettings
Parameters
document Document
 Document where created settings is saved.
name String
 The name specified to this settings.
Return Value
ExportDGNSettings
 The new DGN export settings instance.
Exceptions
Exception | Condition
ArgumentException |  ExistOrEmpty
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDGNSettings Class
Create Overload
Autodesk.Revit.DB Namespace